# 1. Carga de Librerias

In [79]:
import pandas as pd
import datetime as dt
import pandasql as ps

# 2. Opciones y Parametros Globales

In [26]:
pd.set_option("display.max_rows", 30)
pd.set_option("display.max_columns", 100)
pd.set_option("display.float_format", lambda x: "%.1f" % x)
pd.set_option("display.max_colwidth", 200)

# 3. Carga de bases de datos

In [3]:
sales_df = pd.read_csv(r'C:\Users\germa\Desktop\Sumz\WS_DE\WS_SumzDE\sales.csv\sales.csv', sep=",")
prod_df = pd.read_csv(r'C:\Users\germa\Desktop\Sumz\WS_DE\WS_SumzDE\product_hierarchy.csv', sep=",")
stores_df = pd.read_csv(r'C:\Users\germa\Desktop\Sumz\WS_DE\WS_SumzDE\store_cities.csv', sep=",")

C:\Users\germa\AppData\Local\Temp\ipykernel_16876\3694015625.py:1: DtypeWarning: Columns (10,12) have mixed types. Specify dtype option on import or set low_memory=False.
  sales_df = pd.read_csv(r'C:\Users\germa\Desktop\Sumz\WS_DE\WS_SumzDE\sales.csv\sales.csv', sep=",")

# 4. EDA bases de datos

In [12]:
sales_df.head(10)

,product_id,store_id,date,sales,revenue,stock,price,promo_type_1,promo_bin_1,promo_type_2,promo_bin_2,promo_discount_2,promo_discount_type_2
0,P0001,S0002,2017-01-02,0.00000,0.00000,8.00000,6.25000,PR14,NaN,PR03,NaN,NaN,NaN
1,P0001,S0012,2017-01-02,1.00000,5.30000,0.00000,6.25000,PR14,NaN,PR03,NaN,NaN,NaN
2,P0001,S0013,2017-01-02,2.00000,10.59000,0.00000,6.25000,PR14,NaN,PR03,NaN,NaN,NaN
3,P0001,S0023,2017-01-02,0.00000,0.00000,6.00000,6.25000,PR14,NaN,PR03,NaN,NaN,NaN
4,P0001,S0025,2017-01-02,0.00000,0.00000,1.00000,6.25000,PR14,NaN,PR03,NaN,NaN,NaN
5,P0001,S0027,2017-01-02,0.00000,0.00000,7.00000,6.25000,PR14,NaN,PR03,NaN,NaN,NaN
6,P0001,S0040,2017-01-02,0.00000,0.00000,19.00000,6.25000,PR14,NaN,PR03,NaN,NaN,NaN
7,P0001,S0049,2017-01-02,0.00000,0.00000,8.00000,6.25000,PR14,NaN,PR03,NaN,NaN,NaN
8,P0001,S0050,2017-01-02,0.00000,0.00000,5.00000,6.25000,PR14,NaN,PR03,NaN,NaN,NaN
9,P0001,S0051,2017-01-02,0.00000,0.00000,6.00000,6.25000,PR14,NaN,PR03,NaN,NaN,NaN

In [13]:
prod_df.head(10)

,product_id,product_length,product_depth,product_width,cluster_id,hierarchy1_id,hierarchy2_id,hierarchy3_id,hierarchy4_id,hierarchy5_id
0,P0000,5.00000,20.00000,12.00000,NaN,H00,H0004,H000401,H00040105,H0004010534
1,P0001,13.50000,22.00000,20.00000,cluster_5,H01,H0105,H010501,H01050100,H0105010006
2,P0002,22.00000,40.00000,22.00000,cluster_0,H03,H0315,H031508,H03150800,H0315080028
3,P0004,2.00000,13.00000,4.00000,cluster_3,H03,H0314,H031405,H03140500,H0314050003
4,P0005,16.00000,30.00000,16.00000,cluster_9,H03,H0312,H031211,H03121109,H0312110917
5,P0006,8.50000,15.00000,15.00000,cluster_0,H03,H0316,H031608,H03160817,H0316081708
6,P0007,2.00000,22.00000,9.50000,cluster_4,H03,H0313,H031305,H03130519,H0313051904
7,P0008,5.00000,16.00000,5.00000,cluster_0,H00,H0000,H000004,H00000400,H0000040017
8,P0009,5.00000,18.00000,14.00000,cluster_6,H00,H0002,H000201,H00020100,H0002010012
9,P0010,2.00000,22.00000,3.00000,cluster_0,H01,H0108,H010801,H01080109,H0108010917

In [14]:
stores_df.head(10)

  store_id storetype_id  store_size city_id
0    S0091         ST04          19    C013
1    S0012         ST04          28    C005
2    S0045         ST04          17    C008
3    S0032         ST03          14    C019
4    S0027         ST04          24    C022
5    S0088         ST04          20    C009
6    S0095         ST02          44    C014
7    S0055         ST04          24    C014
8    S0099         ST03          14    C014
9    S0078         ST04          19    C036

# 5. Preguntas

1. Quisiera saber cuáles fueron los productos más populares cada mes durante el año 2018. ¿Me puedes mostrar esa información?

In [16]:
#Conversion de columna tipo 'object' a tipo datetime y extraccion de año y mes de cada fecha respectiva
sales_df['date'] = pd.to_datetime(sales_df['date'])
sales_df['year'] = sales_df['date'].dt.year
sales_df['month'] = sales_df['date'].dt.month

In [80]:
sales_df

,product_id,store_id,date,sales,revenue,stock,price,promo_type_1,promo_bin_1,promo_type_2,promo_bin_2,promo_discount_2,promo_discount_type_2,year,month,ANNIO_MES
0,P0001,S0002,2017-01-02,0.0,0.0,8.0,6.2,PR14,NaN,PR03,NaN,NaN,NaN,2017,1,2017-1
1,P0001,S0012,2017-01-02,1.0,5.3,0.0,6.2,PR14,NaN,PR03,NaN,NaN,NaN,2017,1,2017-1
2,P0001,S0013,2017-01-02,2.0,10.6,0.0,6.2,PR14,NaN,PR03,NaN,NaN,NaN,2017,1,2017-1
3,P0001,S0023,2017-01-02,0.0,0.0,6.0,6.2,PR14,NaN,PR03,NaN,NaN,NaN,2017,1,2017-1
4,P0001,S0025,2017-01-02,0.0,0.0,1.0,6.2,PR14,NaN,PR03,NaN,NaN,NaN,2017,1,2017-1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19454833,P0748,S0125,2019-12-29,NaN,NaN,NaN,18.9,PR14,NaN,PR03,NaN,NaN,NaN,2019,12,2019-12
19454834,P0748,S0126,2019-12-29,NaN,NaN,NaN,18.9,PR14,NaN,PR03,NaN,NaN,NaN,2019,12,2019-12
19454835,P0748,S0131,2019-12-29,NaN,NaN,NaN,18.9,PR14,NaN,PR03,NaN,NaN,NaN,2019,12,2019-12
19454836,P0748,S0132,2019-12-29,NaN,NaN,NaN,18.9,PR14,NaN,PR03,NaN,NaN,NaN,2019,12,2019-12
19454837,P0748,S0142,2019-12-29,NaN,NaN,NaN,18.9,PR14,NaN,PR03,NaN,NaN,NaN,2019,12,2019-12

In [21]:
sales_2018 = sales_df[sales_df['year'] == 2018].groupby(['month', 'product_id']).agg(volumen = ('sales', 'sum'),
                                                                     ingresos = ('revenue', 'sum')).reset_index()
sales_2018 = sales_2018.groupby('month', group_keys=False).apply(lambda x: x.sort_values('volumen', ascending=False))

In [27]:
#RESPUESTA
#Top 5 de productos por mes mas populares por volumen para el año 2018
sales_2018.groupby('month').head(5).head(20)

      month product_id  volumen  ingresos
228       1      P0438  21326.0    9872.7
46        1      P0103  19046.0   51534.0
188       1      P0364   7984.0    7395.4
19        1      P0051   7754.0    5027.0
306       1      P0590   5692.0    3136.3
630       2      P0438  21485.0    9946.4
441       2      P0103  16474.0   51085.5
411       2      P0051   7555.0    4749.9
600       2      P0388   6212.0    9318.0
708       2      P0590   5952.0    3282.8
1042      3      P0438  23154.0   10366.4
848       3      P0103  17923.0   56245.9
1011      3      P0388  11840.0   17760.0
1001      3      P0364  10505.0    9902.8
817       3      P0051   9635.0    5978.4
1471      4      P0438  24392.0   11185.2
1273      4      P0103  19166.0   61207.4
1439      4      P0388  10965.0   16447.5
1239      4      P0051   7448.0    4828.6
1286      4      P0131   6788.0   10825.0

2. Necesito saber en cuántas tiendas se implementaron promociones del tipo 1 en el canal 1 durante el año 2019. ¿Puedes darme ese dato?</li>

In [30]:
#RESPUESTA
sales_df[(sales_df['year'] == 2019) & (sales_df['promo_type_1'].notnull()) & (sales_df['promo_bin_1'].notnull())]['store_id'].nunique()

144

3. Me gustaría saber cuál fue la ciudad que tuvo el mayor volumen de ventas en general durante todo el periodo de 2017 a 2019. ¿Tienes esa información disponible?

In [32]:
store_sales = sales_df[sales_df['year'].isin([2017, 2018, 2019])].groupby('store_id')['sales'].sum().reset_index()
store_sales = pd.merge(store_sales, stores_df[['store_id', 'city_id']], on = 'store_id', how = 'left')
store_sales.groupby('city_id')['sales'].sum().reset_index().sort_values('sales', ascending=False).head(10)

   city_id     sales
13    C014 2573439.6
21    C022  906317.9
30    C031  803258.2
35    C036  375269.9
23    C024  286316.1
19    C020  270745.1
24    C025  224365.0
3     C004  203209.0
5     C006  184889.9
28    C029  180286.5

4. ¿Podrías decirme cuál fue el promedio de stock disponible en todas las tiendas durante el año 2017? Estoy interesado en conocer ese dato.

In [33]:
sales_df[sales_df['year'] == 2017]['stock'].mean()

16.615350795266163

5. Estoy buscando saber cuántas veces se aplicaron descuentos en el canal 2 durante el mes de diciembre de 2018. ¿Puedes ayudarme con esa información?

In [34]:
sales_df[(sales_df['year'] == 2018) &
         (sales_df['month'] == 12) &
         (sales_df['promo_bin_2'].notnull())].shape[0]

0

6. ¿Cuál fue el producto con el precio de venta más alto en cada tienda durante el tercer trimestre de 2019? Me gustaría conocer esos detalles.

In [41]:
price_hist = sales_df[(sales_df['date'] >= '2019-07-01') & (sales_df['date'] <= '2019-09-30')].groupby(['store_id', 'product_id'])['price'].max().reset_index()
price_hist = price_hist.groupby('store_id', group_keys=False).apply(lambda x: x.sort_values('price', ascending=False))

In [46]:
#RESPUESTA
price_hist.groupby('store_id').head(1).sort_values('store_id').head(20)

     store_id product_id  price
225     S0001      P0498  299.9
626     S0002      P0708 1599.0
692     S0003      P0498  299.9
823     S0004      P0498  299.9
967     S0005      P0498  299.9
1055    S0006      P0680  139.9
1101    S0007      P0391  179.9
1297    S0008      P0498  299.9
1449    S0009      P0680  139.9
1593    S0010      P0680  139.9
1644    S0011      P0391  179.9
1887    S0012      P0708 1349.0
2145    S0013      P0708 1499.0
2203    S0014      P0391  179.9
2324    S0015      P0391  179.9
2447    S0016      P0498  299.9
2620    S0017      P0517  199.9
2787    S0018      P0391  179.9
2927    S0019      P0680  139.9
3126    S0020      P0474  499.0

7. Estoy interesado en saber cuántas tiendas experimentaron un aumento de ventas del 20% o más en comparación con el año anterior. ¿Tienes esos datos disponibles?

In [57]:
sales_hist = sales_df.groupby(['store_id', 'year'])['revenue'].sum().reset_index().sort_values(['store_id', 'year'])
sales_hist['previous_year_sales'] = sales_hist.groupby(['store_id'])['revenue'].shift(1)
sales_hist['change_previous_year'] = (sales_hist['revenue'] - sales_hist['previous_year_sales'])/sales_hist['previous_year_sales']
sales_hist = sales_hist[sales_hist['change_previous_year'].notnull()]

In [58]:
sales_hist.head(10)

   store_id  year  revenue  previous_year_sales  change_previous_year
1     S0001  2018 272539.5             209592.8                   0.3
2     S0001  2019 364909.9             272539.5                   0.3
4     S0002  2018 175934.9             125121.2                   0.4
5     S0002  2019 193065.5             175934.9                   0.1
7     S0003  2018  45476.8              32671.8                   0.4
8     S0003  2019  53998.1              45476.8                   0.2
10    S0004  2018  54630.8              46053.3                   0.2
11    S0004  2019  73436.1              54630.8                   0.3
13    S0005  2019  55415.4              52677.0                   0.1
15    S0006  2018  11806.3               9274.5                   0.3

In [54]:
#RESPUESTA
v1 = sales_hist[(sales_hist['year'] == 2019) & 
                (sales_hist['change_previous_year'] >= 0.2)]['store_id'].nunique()
v2 = sales_hist[sales_hist['change_previous_year'] >= 0.2]['store_id'].nunique()
print(f"Numero de tiendas que aumentaron sus ventas entre el 2018 al 2019 en al menos un 20%: {v1} \nNumero de tiendas que aumentaron sus ventas en comparasion con el año anterior en al menos un 20%: {v2}")

Numero de tiendas que aumentaron sus ventas entre el 2018 al 2019 en al menos un 20%: 48
Numero de tiendas que aumentaron sus ventas en comparasion con el año anterior en al menos un 20%: 125

8. Quisiera saber cuál fue el producto que experimentó la mayor variación de precio a lo largo del periodo de 2017 a 2019. ¿Puedes proporcionarme esa información?

In [61]:
price_hist = sales_df.groupby(['product_id', 'year'])['price'].mean().reset_index()
price_hist['initial_price'] = price_hist.groupby(['product_id'])['price'].shift(2)
price_hist = price_hist[price_hist['initial_price'].notnull()]
price_hist['price_variation'] = (price_hist['price'] - price_hist['initial_price'])/price_hist['initial_price']

In [63]:
#RESPUESTA
price_hist.sort_values('price_variation', ascending=False)

     product_id  year  price  initial_price  price_variation
175       P0089  2019   19.6            5.4              2.7
117       P0061  2019   24.2            7.7              2.2
1387      P0671  2019    8.2            3.2              1.5
287       P0147  2019   12.7            5.1              1.5
375       P0183  2019   16.0            6.4              1.5
...         ...   ...    ...            ...              ...
1053      P0511  2019   11.1           31.2             -0.6
456       P0218  2019   18.7           59.9             -0.7
218       P0109  2019    2.8            9.3             -0.7
705       P0343  2019    2.5           17.8             -0.9
1495      P0720  2019    0.4           15.3             -1.0

[375 rows x 5 columns]

9. ¿Sabes en qué mes y año se registró la mayor cantidad de ingresos generados en todas las tiendas? Estoy interesado en conocer ese dato importante.

In [66]:
sales_df['ANNIO_MES'] = sales_df['year'].astype(str) + "-" + sales_df['month'].astype(str)

In [69]:
sales_df.groupby('ANNIO_MES')['revenue'].sum().reset_index().sort_values('revenue', ascending=False).head(10)

   ANNIO_MES   revenue
34    2019-8 2619132.6
32    2019-6 1534773.3
33    2019-7 1533953.3
35    2019-9 1520782.6
25   2019-10 1495226.6
19    2018-5 1372225.1
15   2018-12 1308907.9
31    2019-5 1284677.0
29    2019-3 1278991.9
13   2018-10 1263367.7

10. Me gustaría saber cuál fue el tamaño promedio de las tiendas en cada ciudad durante el año 2018. ¿Puedes darme esa información?

In [70]:
stores = sales_df[sales_df['year'] == 2018]['store_id'].unique()
store_sizes = stores_df[stores_df['store_id'].isin(stores)].groupby('city_id')['store_size'].mean().reset_index().sort_values('store_size', ascending=False).head(10)

In [78]:
store_sizes

   city_id  store_size
3     C004        63.0
1     C002        47.0
34    C036        43.0
14    C015        42.0
6     C007        39.0
26    C027        39.0
32    C033        35.0
15    C016        35.0
16    C017        34.0
10    C011        31.0